# Вказуємо базовий образ (початковий "шаблон" для нашого контейнера)
# Беремо легку версію Linux (slim-bullseye), де вже встановлено Python 3.12
FROM python:3.12-slim-bullseye

# Налаштовуємо змінні оточення для Python
# PYTHONUNBUFFERED 1 означає, що вивід тексту (наприклад, логи) не буде затримуватись у буфері, 
# а одразу виводитиметься на екран. Це допомагає швидко бачити помилки.
ENV PYTHONUNBUFFERED 1

# Забороняємо Python створювати .pyc файли (кеш коду), щоб не засмічувати контейнер
ENV PYTHONDONTWRITEBYTECODE 1

# Створюємо робочу папку всередині контейнера і переходимо в неї. 
# Усі наступні команди будуть виконуватися саме тут.
WORKDIR /app

# Оновлюємо список пакетів Linux і встановлюємо компілятор gcc.
# gcc часто потрібен для встановлення деяких специфічних Python-бібліотек.
# Після встановлення одразу видаляємо тимчасові файли (rm -rf /var/lib/apt/lists/*), 
# щоб зробити фінальний розмір нашого образу якомога меншим.
RUN apt-get update && apt-get install -y \
    gcc \
    && rm -rf /var/lib/apt/lists/*

# Копіюємо файл зі списком залежностей (бібліотек) з нашого комп'ютера в папку /app/ контейнера
COPY requirements.txt /app/

# Встановлюємо всі бібліотеки зі списку. 
# Прапорець --no-cache-dir каже pip не зберігати архіви завантажених файлів (економить місце).
RUN pip install --no-cache-dir -r requirements.txt

# Копіюємо весь інший код нашого проєкту з комп'ютера у папку /app/ контейнера.
# Робимо це саме зараз, а не раніше, щоб Docker міг закешувати етап встановлення бібліотек 
# і не перевстановлював їх заново при кожній дрібній зміні в коді.
COPY . /app/


# "Документаційний" рядок. Він просто повідомляє Docker, 
# що наша програма всередині контейнера буде працювати на порту 8000.
EXPOSE 8000

# Головна команда, яка виконається під час запуску самого контейнера.
# Вона запускає gunicorn (популярний вебсервер для Python), вказує йому використовувати 
# налаштування проєкту (pagination.wsgi) і слухати всі адреси (0.0.0.0) на порту 8000.
ENTRYPOINT [ "gunicorn", "gamehub.wsgi", "-b", "0.0.0.0:8000" ]